#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_management_zone.data.external.databricks_access_token: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.external.databricks_access_token: Read complete after 4s [id=-][0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.automation_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-automation-rg][0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.consumption_synapse_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.container_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg][0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.governance_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg][0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.purview_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.purview_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.consumption_adb_rg["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg][0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.consumption_adb_rg["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg][0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_management_zone.module.container_registry.azurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mmodule.data_management_zone.module.synapse_private_link_hub.azurerm_synapse_private_link_hub.synapse_private_link_hub: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001][0m
[0m[1mmodule.data_management_zone.module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mmodule.data_management_zone.module.purview_account.azapi_resource.purview_account: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001][0m
[0m[1mmodule.data_management_zone.module.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-automation-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mydmgmt-dev-uai001][0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_management_zone.azapi_resource.private_endpoint_subnet: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ServicesSubnet][0m
[0m[1mmodule.data_management_zone.azurerm_network_security_group.network_security_group_databricks["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001][0m
[0m[1mmodule.data_management_zone.azurerm_route_table.route_table_databricks["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-northeurope-rt001][0m
[0m[1mmodule.data_management_zone.azurerm_route_table.route_table_databricks["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-westus-rt001][0m
[0m[1mmodule.data_management_zone.azurerm_network_security_group.network_security_group_databricks["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001][0m
[0m[1mmodule.data_management_zone.module.databricks_access_connector["northeurope"].azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-northeurope-dbac001][0m
[0m[1mmodule.data_management_zone.module.databricks_access_connector["westus"].azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-westus-dbac001][0m
[0m[1mmodule.data_management_zone.module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/7dade4e4-d974-1099-4708-86c6fb5580fd][0m
[0m[1mmodule.data_management_zone.module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.data_management_zone.azurerm_virtual_network.virtual_network_databricks["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001][0m
[0m[1mmodule.data_management_zone.azurerm_virtual_network.virtual_network_databricks["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001][0m
[0m[1mmodule.data_management_zone.module.synapse_private_link_hub.azurerm_private_endpoint.private_endpoint_synapse_private_link_hub_web: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-web-pe][0m
[0m[1mmodule.data_management_zone.module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-vault-pe][0m
[0m[1mmodule.data_management_zone.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-registry-pe][0m
[0m[1mmodule.data_management_zone.module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mmodule.data_management_zone.module.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mmodule.data_management_zone.module.container_registry.azurerm_monitor_diagnostic_setting.diagnostic_setting_container_registry["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_blob: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-blob-pe][0m
[0m[1mmodule.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_queue: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-queue-pe][0m
[0m[1mmodule.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_platform: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-platform-pe][0m
[0m[1mmodule.data_management_zone.azurerm_role_assignment.purview_roleassignment_key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/6a42cdcd-bef2-52fb-1e86-4bd49635cb19][0m
[0m[1mmodule.data_management_zone.module.purview_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_purview_account["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001][0m
[0m[1mmodule.data_management_zone.module.container_registry.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-18T21:25:18Z][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-uiapi-pe][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-uiapi-pe][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-18T21:25:17Z][0m
[0m[1mmodule.data_management_zone.module.synapse_private_link_hub.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-18T21:25:18Z][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001][0m
[0m[1mmodule.data_management_zone.module.purview_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-19T11:03:55Z][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace: Read complete after 2s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-auth-pe][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-auth-pe][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-19T18:17:30Z][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-19T18:17:30Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_management_zone.azurerm_network_security_group.network_security_group_databricks["northeurope"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_network_security_group" "network_security_group_databricks" {
        id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001"
        name                = "mydmgmt-dev-northeurope-nsg001"
      [33m~[0m[0m security_rule       = [
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker communication with Azure Eventhub services."
              [31m-[0m[0m destination_address_prefix                 = "EventHub"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "9093"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-eventhub"
              [31m-[0m[0m priority                                   = 103
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Inbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-inbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-outbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure SQL services."
              [31m-[0m[0m destination_address_prefix                 = "Sql"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "3306"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-sql"
              [31m-[0m[0m priority                                   = 101
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure Storage services."
              [31m-[0m[0m destination_address_prefix                 = "Storage"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "443"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-storage"
              [31m-[0m[0m priority                                   = 102
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
        ]
        tags                = {}
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_network_security_group.network_security_group_databricks["westus"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_network_security_group" "network_security_group_databricks" {
        id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001"
        name                = "mydmgmt-dev-westus-nsg001"
      [33m~[0m[0m security_rule       = [
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker communication with Azure Eventhub services."
              [31m-[0m[0m destination_address_prefix                 = "EventHub"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "9093"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-eventhub"
              [31m-[0m[0m priority                                   = 103
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Inbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-inbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-outbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure SQL services."
              [31m-[0m[0m destination_address_prefix                 = "Sql"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "3306"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-sql"
              [31m-[0m[0m priority                                   = 101
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure Storage services."
              [31m-[0m[0m destination_address_prefix                 = "Storage"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "443"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-storage"
              [31m-[0m[0m priority                                   = 102
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
        ]
        tags                = {}
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.purview_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_purview_account[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_purview_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001"
    }

[1m  # module.data_management_zone.module.purview_account.azapi_resource.purview_account[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_resource" "purview_account" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m cloudConnectors                     = {
                  [31m-[0m[0m awsExternalId = "b089a84e-deef-4a93-8da8-bfefc57f7e6a"
                } [33m->[0m[0m [90mnull[0m[0m
                [90m# (6 unchanged attributes hidden)[0m[0m
            }
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
        id                        = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001"
        name                      = "mydmgmt-dev-pview001"
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001"
          [31m-[0m[0m identity   = {
              [31m-[0m[0m principalId = "f49474f4-9fba-460d-8072-ff932614ee08"
              [31m-[0m[0m tenantId    = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
              [31m-[0m[0m type        = "SystemAssigned"
            }
          [31m-[0m[0m location   = "westus"
          [31m-[0m[0m name       = "mydmgmt-dev-pview001"
          [31m-[0m[0m properties = {
              [31m-[0m[0m accountStatus                       = {
                  [31m-[0m[0m accountProvisioningState = "Succeeded"
                }
              [31m-[0m[0m cloudConnectors                     = {
                  [31m-[0m[0m awsExternalId = "b089a84e-deef-4a93-8da8-bfefc57f7e6a"
                }
              [31m-[0m[0m createdAt                           = "2024-11-19T11:01:09.6840011Z"
              [31m-[0m[0m createdBy                           = "320d6fb4-6716-479f-bd77-bf80ef559b74"
              [31m-[0m[0m createdByObjectId                   = "612081e2-c034-4d91-91f8-50c4390fbf50"
              [31m-[0m[0m defaultDomain                       = "mydmgmt-dev-pview001"
              [31m-[0m[0m endpoints                           = {
                  [31m-[0m[0m catalog = "https://37963dd4-f4e6-40f8-a7d6-24b97919e452-api.purview-service.microsoft.com/catalog"
                  [31m-[0m[0m scan    = "https://37963dd4-f4e6-40f8-a7d6-24b97919e452-api.purview-service.microsoft.com/scan"
                }
              [31m-[0m[0m friendlyName                        = "mydmgmt-dev-pview001"
              [31m-[0m[0m ingestionStorage                    = {
                  [31m-[0m[0m id                  = "/subscriptions/c86abcfa-2ad1-43ec-8412-4ac039399029/resourceGroups/ingestion-storage-rg-westus-5/providers/Microsoft.Storage/storageAccounts/ingestionwusdpozbyn"
                  [31m-[0m[0m primaryEndpoint     = "https://ingestionwusdpozbyn.z28.blob.storage.azure.net/"
                  [31m-[0m[0m publicNetworkAccess = "Disabled"
                }
              [31m-[0m[0m managedEventHubState                = "Disabled"
              [31m-[0m[0m managedResourcesPublicNetworkAccess = "Disabled"
              [31m-[0m[0m privateEndpointConnections          = [
                  [31m-[0m[0m {
                      [31m-[0m[0m id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001/privateEndpointConnections/mydmgmt-dev-pview001-platform-pe-8d891bf6-a8ec-4a93-ad51-3c0ee4f9a05e"
                      [31m-[0m[0m name       = "mydmgmt-dev-pview001-platform-pe-8d891bf6-a8ec-4a93-ad51-3c0ee4f9a05e"
                      [31m-[0m[0m properties = {
                          [31m-[0m[0m privateEndpoint                   = {
                              [31m-[0m[0m id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-platform-pe"
                            }
                          [31m-[0m[0m privateLinkServiceConnectionState = {
                              [31m-[0m[0m actionsRequired = "None"
                              [31m-[0m[0m status          = "Approved"
                            }
                          [31m-[0m[0m provisioningState                 = "Succeeded"
                        }
                      [31m-[0m[0m type       = "Microsoft.Purview/accounts/privateEndpointConnections"
                    },
                ]
              [31m-[0m[0m provisioningState                   = "Succeeded"
              [31m-[0m[0m publicNetworkAccess                 = "Enabled"
              [31m-[0m[0m tenantEndpointState                 = "Enabled"
            }
          [31m-[0m[0m sku        = {
              [31m-[0m[0m capacity = 1
              [31m-[0m[0m name     = "Standard"
            }
          [31m-[0m[0m systemData = {
              [31m-[0m[0m createdAt          = "2024-11-19T11:01:09.6840011Z"
              [31m-[0m[0m createdBy          = "320d6fb4-6716-479f-bd77-bf80ef559b74"
              [31m-[0m[0m createdByType      = "Application"
              [31m-[0m[0m lastModifiedAt     = "2024-11-19T18:10:57.1838847Z"
              [31m-[0m[0m lastModifiedBy     = "320d6fb4-6716-479f-bd77-bf80ef559b74"
              [31m-[0m[0m lastModifiedByType = "Application"
            }
          [31m-[0m[0m type       = "Microsoft.Purview/accounts"
        } -> (known after apply)
        tags                      = {}
        [90m# (8 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_purview_account["0"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_purview_account" {
        id                             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001|applicationLogs-0"
        name                           = "applicationLogs-0"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_blob[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_blob" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-blob-pe" -> (known after apply)
        name                          = "mydmgmt-dev-pview001-ing-blob-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-pview001-ing-blob-nic"
              [31m-[0m[0m name = "mydmgmt-dev-pview001-ing-blob-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-blob-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-arecord/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              [31m-[0m[0m name                = "privatelink.blob.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              [31m-[0m[0m record_sets         = []
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-blob-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-pview001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-pview001-ing-blob-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/c86abcfa-2ad1-43ec-8412-4ac039399029/resourceGroups/ingestion-storage-rg-westus-5/providers/Microsoft.Storage/storageAccounts/ingestionwusdpozbyn" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.11" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_queue[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_queue" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-queue-pe" -> (known after apply)
        name                          = "mydmgmt-dev-pview001-ing-queue-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-pview001-ing-queue-nic"
              [31m-[0m[0m name = "mydmgmt-dev-pview001-ing-queue-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-queue-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-arecord/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              [31m-[0m[0m name                = "privatelink.queue.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              [31m-[0m[0m record_sets         = []
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-queue-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-pview001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-pview001-ing-queue-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/c86abcfa-2ad1-43ec-8412-4ac039399029/resourceGroups/ingestion-storage-rg-westus-5/providers/Microsoft.Storage/storageAccounts/ingestionwusdpozbyn" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.7" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1mPlan:[0m 2 to add, 4 to change, 2 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>